In [1]:
library(tidyverse)
library(skimr)
library(janitor)

-- Attaching packages ------------------------------------------------------------------------------- tidyverse 1.3.1 --

v ggplot2 3.3.5     v purrr   0.3.4
v tibble  3.1.5     v dplyr   1.0.7
v tidyr   1.1.4     v stringr 1.4.0
v readr   2.0.2     v forcats 0.5.1

-- Conflicts ---------------------------------------------------------------------------------- tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()


Attachement du package : 'janitor'


Les objets suivants sont masqués depuis 'package:stats':

    chisq.test, fisher.test

In [2]:
id <- c(1:10)
name <- c("John Mendes", "Rob Stewart", "Rachel Abrahamson", "Christy Hickman", "Johnson Harper", "Candace Miller", "Carlson Landy", "Pansy Jordan", "Darius Berry", "Claudia Garcia")
job_title <- c("Professional", "Programmer", "Management", "Clerical", "Developer", "Programmer", "Management", "Clerical", "Developer", "Programmer")
employee <- data.frame(id, name, job_title)

employee <- data.frame(id, name, job_title)

In [3]:
print(employee)

   id              name    job_title
1   1       John Mendes Professional
2   2       Rob Stewart   Programmer
3   3 Rachel Abrahamson   Management
4   4   Christy Hickman     Clerical
5   5    Johnson Harper    Developer
6   6    Candace Miller   Programmer
7   7     Carlson Landy   Management
8   8      Pansy Jordan     Clerical
9   9      Darius Berry    Developer
10 10    Claudia Garcia   Programmer

**separate() :** split the target following a specific separator

In [4]:
sep_employee <- separate(employee,name,into = c('first_name','last_name'),sep = ' ')

In [5]:
sep_employee

   id first_name last_name  job_title
1   1 John       Mendes     Professional
2   2 Rob        Stewart    Programmer
3   3 Rachel     Abrahamson Management
4   4 Christy    Hickman    Clerical
5   5 Johnson    Harper     Developer
6   6 Candace    Miller     Programmer
7   7 Carlson    Landy      Management
8   8 Pansy      Jordan     Clerical
9   9 Darius     Berry      Developer
10 10 Claudia    Garcia     Programmer

**unite() :** concatenate the columns into one

In [6]:
unite(sep_employee,'name',first_name,last_name,sep = ' ')

   id name              job_title
1   1 John Mendes       Professional
2   2 Rob Stewart       Programmer
3   3 Rachel Abrahamson Management
4   4 Christy Hickman   Clerical
5   5 Johnson Harper    Developer
6   6 Candace Miller    Programmer
7   7 Carlson Landy     Management
8   8 Pansy Jordan      Clerical
9   9 Darius Berry      Developer
10 10 Claudia Garcia    Programmer

In [7]:
library(palmerpenguins)

In [8]:
penguins[seq.int(10),]  %>% mutate(body_mass_kg = body_mass_g/1000,flipper_length_m = flipper_length_mm / 1000)

   species island    bill_length_mm bill_depth_mm flipper_length_mm body_mass_g
1  Adelie  Torgersen 39.1           18.7          181               3750
2  Adelie  Torgersen 39.5           17.4          186               3800
3  Adelie  Torgersen 40.3           18.0          195               3250
4  Adelie  Torgersen   NA             NA           NA                 NA
5  Adelie  Torgersen 36.7           19.3          193               3450
6  Adelie  Torgersen 39.3           20.6          190               3650
7  Adelie  Torgersen 38.9           17.8          181               3625
8  Adelie  Torgersen 39.2           19.6          195               4675
9  Adelie  Torgersen 34.1           18.1          193               3475
10 Adelie  Torgersen 42.0           20.2          190               4250
   sex    year body_mass_kg flipper_length_m
1  male   2007 3.750        0.181
2  female 2007 3.800        0.186
3  female 2007 3.250        0.195
4  NA     2007    NA           NA
5  female 2007 3.450        0.193
6  male   2007 3.650        0.190
7  female 2007 3.625        0.181
8  male   2007 4.675        0.195
9  NA     2007 3.475        0.193
10 NA     2007 4.250        0.190